БухЭксп/InformationRegisters/CW_ДоступностьСтатусовПоГруппамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступностьСтатусовПоГруппамПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступностьСтатусовПоГруппамПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассиивДоступныхСтатусовГруппыПользователя(ГруппаПользователя, мСтатусыОбъектаМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента.Код КАК Код,
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента КАК СтатусДокумента
	               |ИЗ
	               |	РегистрСведений.CW_ДоступностьСтатусовПоГруппамПользователей КАК CW_ДоступностьСтатусовПоГруппамПользователей
	               |ГДЕ
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя
	               |	И CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента В(&мСтатусыОбъектаМетаданных)
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ГруппаПользователя);
	Запрос.УстановитьПараметр("мСтатусыОбъектаМетаданных", 	мСтатусыОбъектаМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.СтатусДокумента);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
